{ 
    "Portfolio" : {
        "CG" : [
                {"Castle": "img/3dcg/castle.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A commissioned piece. Used Cinema 4D, Octane Renderer with ivy grower and forester plugins. Most models used in this scene are from Megascans and some Kitbash. Post processing done in Photoshop and Adobe lightroom (Filters)", "Title" : "Overgrown Castle"},
                {"Concrete": "img/3dcg/concrete.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. Used Cinema 4D, Octane Renderer, and used displacement mapping for a highly realistic displaced concrete texture (from a megascan). Post processing done almost entirely in Octane alone, with a filter added in Lightroom for dramatic effect.", "Title" : "Broken Concrete"},
                {"Cube": "img/3dcg/cube.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Person piece. Used Cinema 4D, Octane Renderer, entirely done through displacement mapping using a circuit-board style displacement map and heavy fog volumetrics for the godrays and atmosphere. Color correction and some minor detail cleanup in Photoshop and grain filter added with Lightroom", "Title" : "Circuit Cube"},
                {"Fleur": "img/3dcg/fleur.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A commissioned piece. Used Cinema 4D with Octane Renderer. Pretty simple render, went for a highly photorealistic quality. Very little post processing other than a generic film-quality noise filter and some minor color correction. Logo was designed in Photoshop and imported into Cinema4D with Illustrator paths.", "Title" : "Fleur Logo"},
                {"Gold": "img/3dcg/gold.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A commissioned piece. Used Cinema 4D with Octane Renderer with some interesting camera effects (DoF, Bokeh, etc..) and pretty heavy post processing and color correction as it was hard to capture a really nice gold color. ", "Title" : "Gold Paper"},
                {"Pyramid": "img/3dcg/pyramid.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. One of my first creations using Octane Render and heavy displacement mapping, before I had other plugins like forester or ivy grower. Basically all parts of this scene are displacement mapping, even the foliage. The boats and pyramid are not displaced. Moderate post processing work done exclusively in Photoshop. I would do a lot of things very different if I were to remake this scene or a scene similar.", "Title" : "Fantasy Pyramid"},
                {"Street": "img/3dcg/street.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. Used several different types of models and techniques for this. Several different sets, heavy cloud volumetrics for fog effects, depth of field, bloom, and glare all done with Octane. Street and concrete are displacement maps, and lightning in the windows and lamp posts are in Octane. ", "Title" : "Fantasy Streets"},
                {"Tree1": "img/3dcg/tree1.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. Made with Cinema 4D + Octane and the high res landscape created in WorldCreator2 with Forester plugin being responsibile for the tree and grass. This project was moreso just a test with new technologies and plugins.", "Title" : "Tree Test"},
                {"Tree2": "img/3dcg/tree2.png", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. Made with Cinema 4D + Octane and the high res landscape created in WorldCreator2 with Forester plugin being responsibile for the tree and grass. This project was moreso just a test with new technologies and plugins.", "Title" : "Tree Test #2"},
                {"Slums": "img/3dcg/spacebois.jpg", "Tech" : ["C4D + Octane", "Photoshop CC 2015", "Lightroom"], "Desc" : "A Personal piece. Made with Cinema 4D + Octane and prodecural buildings with some sci-fi models. Went for a full cinematic look with liberal use of filters, post processing, and general cinematic effects. Heat wave coming from the space props was done entirely in photoshop.", "Title" : "Future Ghetto"}
            ],
        "DEV" : [
                {"Evergreen Organix": "img/dev/evergreen.png", "Tech" : ["Wordpress", "Jquery", "Photoshop CC"], "Desc" : "This is a company I personally worked for as a Laboratory Technician and was responsible for our online presence as well. Backend uses Wordpress for content management as well as a semi-custom theme. Mainly a static content site with some API integration with stores in the Las Vegas area for stock and prices.", "Title" : "Evergreen Organix", "Repo": "", "Demo": "http://www.evergreenorganix.com"},
                {"Synthesis": "img/dev/synthesis.png", "Tech" : ["ReactJS + Redux", "Node", "Express", "MongoDB", "Socket.io", "Photoshop CC"], "Desc" : "Synthesis is a unique way to watch your favorite live game streamers who are playing in the same game instance, at the same time, together. This project uses a Node.js backend with Express and MongoDB providing a RESTful API to the front end, and the front-end is completely in React. This is also https enabled (using certbot) and cloudfare. This could could not be developed properly with mobile in mind due to its nature. All design and development from start to finish was done by myself.", "Title" : "Synthesis", "Repo": "https://github.com/aaronjlilla/Synthesis", "Demo": ""},
                {"Rock and Stone": "img/dev/rockandstone.png", "Tech" : ["Socket.io", "Jquery", "Steam API", "Photoshop CC", "MongoDB"], "Desc" : "Rock and Stone is a websocket (socket.io) based online matchmaking system for the game Deep Rock Galactic. It uses Steam OAuth and the Steam API allowing users to que up in a traditional matchmaking system based on certain criteria. This was developed heavily with websockets to provide a seamless and fast matchmaking experience. DOM manipulation was done entirely in jQuery, although React was an option and I regret not opting for that option for obvious reasons. All design and development from start to finish was done by myself.", "Title" : "Rock and Stone", "Repo": "", "Demo": ""},
                {"Wii Play Games": "img/dev/wiiplaygames.png", "Tech" : ["PHP", "JQuery", "Ruby on Rails", "Photoshop CC"], "Desc" : "Wii Play Games is a retail video game & trading card store that I previously worked for and did nearly all of their graphics and development. The front end of this project was done mostly in jquery and php, integrating with the backend API programmed in Ruby on Rails from a 3rd party Point-of-Sales system called Crystal Commerce in which they use both in the store and online. This was primarily a front-end project integrated with systems they currently use. I was also responsible for nearly all graphics development both online and in-store.", "Title" : "Wii Play Games", "Repo": "", "Demo": "http://www.wiiplaygameslv.com"},
                {"V1": "img/dev/v1.png", "Tech" : ["ReactJS", "Node", "Express", "Photoshop CC"], "Desc" : "My personal site I threw together with React and Node.js. Graphics were done in both Photoshop and Cinema4D. I thought it would give an interesting feel to have each page give a different color scheme which is achieved entirely in CSS3 filter (hue) effects. All design and development from start to finish was done by myself.", "Title" : "Personal Site V1", "Repo": "https://github.com/aaronjlilla/personal", "Demo": "http://www.aaronlilla.com/v1"},
                {"V2": "img/dev/v2.png", "Tech" : ["ReactJS", "Node", "Express", "Photoshop CC"], "Desc" : "Second version of my site featuring a much needed UI upgrade, more intuitive layout, and much better mobile responsiveness. Front end was done entirely in React and backend is a node server with express and nodemailer for the contact form functionality. All design and development from start to finish was done by myself.", "Title" : "Personal Site V2", "Repo": "https://github.com/aaronjlilla/v2", "Demo": "http://www.aaronlilla.com/"}
            ],
        "GFX" : [
            {"Wii Play Games": "img/gfx/wii.png", "Tech" : ["Photoshop CC 2015"], "Desc" : "Logo for retail store Wii Play Games in Las Vegas, NV as well as nearly all graphic design work online and in-store.", "Title" : "Wii Play Games"},
            {"Synthesis": "img/gfx/synthlogo.png", "Tech" : ["Photoshop CC 2015"], "Desc" : "Logo design for my personal project Synthesis. Designed the entire site and all graphics from the ground up.", "Title" : "Synthesis"},
            {"EvergreenOrganix": "img/gfx/evergreenorganix.png", "Tech" : ["Photoshop CC 2015"], "Desc" : "Logo for a medical marijuana company here in Las Vegas, NV. Did several logos and packaging designs for this company.", "Title" : "Evergreen Organix"},
            {"Fleur": "img/gfx/fleur.png", "Tech" : ["Photoshop CC 2015"], "Desc" : "Fleur is a medical marijuana grow here in Las Vegas, NV I did some graphics design for and am currently developing a website for in React.", "Title" : "Fleur"},
            {"Rock and Stone": "img/gfx/rockandstone.png", "Tech" : ["Photoshop CC 2015"], "Desc" : "Rock and Stone was a personal website idea I created for the game Deep Rock Galactic as a matchmaking system. Did all graphics and development from the ground up.", "Title" : "Rock and Stone"}
        
        ]
    },
    "About" : {
        "Summary" : {
            "Data" : "Summary",
            "Face" : "/img/face.png",
            "Descat" : ["UI DESIGN", "UX STRATEGY", "App Design", "Logo and Graphics"],
            "Devcat" : ["Full Stack", "ReactJS", "API Integration"]
        },
        "Skills" : {
            "Items" : [
                {"Image" : "/img/skills/html.png", "Name" : "HTML5", "PCT" : 95},
                {"Image" : "/img/skills/css.png", "Name" : "CSS", "PCT" : 90},
                {"Image" : "/img/skills/js.png", "Name" : "JavaScript", "PCT" : 90},
                {"Image" : "/img/skills/sass.png", "Name" : "SASS", "PCT" : 80},
                {"Image" : "/img/skills/jquery.png", "Name" : "jQuery", "PCT" : 70},
                {"Image" : "/img/skills/node.png", "Name" : "NodeJS", "PCT" : 80},
                {"Image" : "/img/skills/react.png", "Name" : "ReactJS", "PCT" : 80},
                {"Image" : "/img/skills/redux.png", "Name" : "Redux", "PCT" : 70},
                {"Image" : "/img/skills/mysql.png", "Name" : "MySQL", "PCT" : 70},
                {"Image" : "/img/skills/php.png", "Name" : "PHP", "PCT" : 50},
                {"Image" : "/img/skills/aftereffects.png", "Name" : "After Effects", "PCT" : 60},
                {"Image" : "/img/skills/photoshop.png", "Name" : "Photoshop", "PCT" : 95},
                {"Image" : "/img/skills/mongo.png", "Name" : "MongoDB", "PCT" : 70}
            ]
        }
    }
}
